app/views/dams/show.html.erb

<h4>Bookings at this dam:</h4>
<% @dam.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."dam_id" = $1  [["dam_id", 60]]