app/views/bookings/_form.html.erb

SELECT  "dams".* FROM "dams" WHERE "dams"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
---
    <p>
      <% @dam = Dam.find params[:dam_id] %>

SELECT "dams".* FROM "dams"
---
        <%= content_tag(:option, dam.name, value: dam.id) %>
      <% end %> <%# Dam.all do %>
    <% end %> <%# f.select :dam do %>