app/views/bookings/_form.html.erb

SELECT  "dams".* FROM "dams" LIMIT $1  [["LIMIT", 1]]
---
  <% else %>
    <%= f.select :dam do %>