app/views/users/show.html.erb

<ul>
<% @user.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."user_id" = $1  [["user_id", 47]]