app/views/pages/dashboard.html.erb

SELECT "users".* FROM "users"
---
        <% @bookings.each do |booking| %>
                <% if @current_user.present? && booking.user_id == @current_user.id %>