app/controllers/bookings_controller.rb

  def new
    @users = User.all
    @dams = Dam.all
    @booking = Booking.new
    @user_select = User.all.pluck(:name, :id)
---
SELECT "users".* FROM "users"
SELECT  "dams".* FROM "dams" WHERE (60) LIMIT $1  [["LIMIT", 1]]
SELECT "users"."name", "users"."id" FROM "users"

  def create
    @dams = Dam.all
    @booking = Booking.create booking_params
    @booking.save
    @user_select = User.all.pluck(:name, :id)
---
SELECT "dams".* FROM "dams"
INSERT INTO "bookings" ("date_time", "car_reg", "created_at", "updated_at", "dam_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date_time", "2022-04-25 15:54:00"], ["car_reg", "S000AAA"], ["created_at", "2022-02-01 04:54:38.168104"], ["updated_at", "2022-02-01 04:54:38.168104"], ["dam_id", 61], ["user_id", 62]]
INSERT INTO "bookings" ("date_time", "car_reg", "created_at", "updated_at", "dam_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["date_time", "2022-02-02 16:30:00"], ["car_reg", "S333QQQ"], ["created_at", "2022-02-01 05:30:10.348413"], ["updated_at", "2022-02-01 05:30:10.348413"], ["dam_id", 60], ["user_id", 62]]
UPDATE "bookings" SET "updated_at" = $1, "user_id" = $2 WHERE "bookings"."id" = $3  [["updated_at", "2022-02-01 04:54:38.172994"], ["user_id", 61], ["id", 58]]
SELECT "users"."name", "users"."id" FROM "users"

  def show
    @booking = Booking.find params[:id]
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 54], ["LIMIT", 1]]

  def edit
    @users = User.all
    @dams = Dam.all
    @booking = Booking.find params[:id]
    @user_select = User.all.pluck(:name, :id)
---
SELECT "users".* FROM "users"
SELECT "dams".* FROM "dams"
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 61], ["LIMIT", 1]]
SELECT "users"."name", "users"."id" FROM "users"

  def update
    @booking = Booking.find params[:id]

    if @current_user.admin == false && @booking.user_id != @current_user.id
      redirect_to bookings_path
      return
    end # booking user_id

    if @booking.update booking_params
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 55], ["LIMIT", 1]]
UPDATE "bookings" SET "dam_id" = $1, "updated_at" = $2 WHERE "bookings"."id" = $3  [["dam_id", 61], ["updated_at", "2022-02-01 01:16:30.489908"], ["id", 55]]

  def destroy
    Booking.destroy params[:id]
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 63]]