app/controllers/dams_controller.rb

INSERT INTO "dams" ("location", "description", "photo", "health", "status", "owner", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @dam = Dam.new dam_params

    if params[:dam][:photo].present?
      # forward image to Cloudinary using gem
      response = Cloudinary::Uploader.upload params[:dam][:photo]
      # p response
      raise 'hell'
      @dam.photo = response['public_id']
    end # upload check

    @dam.save

SELECT "dams".* FROM "dams"
---
  def index
    @dams = Dam.all

SELECT  "dams".* FROM "dams" WHERE "dams"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
---
  def show
    @dam = Dam.find params[:id]

SELECT  "dams".* FROM "dams" WHERE "dams"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
---
  def edit
    @dam = Dam.find params[:id]

SELECT  "dams".* FROM "dams" WHERE "dams"."id" = $1 LIMIT $2  [["id", 60], ["LIMIT", 1]]
UPDATE "dams" SET "photo" = $1, "updated_at" = $2 WHERE "dams"."id" = $3  [["photo", "b0vlltmhhw8o6se0gybp"], ["updated_at", "2022-02-03 04:08:04.933225"], ["id", 60]]
UPDATE "dams" SET "photo" = $1, "updated_at" = $2 WHERE "dams"."id" = $3  [["photo", "#<ActionDispatch::Http::UploadedFile:0x00007fd3eaa4ff40>"], ["updated_at", "2022-02-03 04:08:04.938027"], ["id", 60]]
---
  def update
    dam = Dam.find(params[:id])

    if params[:file].present?
      # forward image to Cloudinary using gem
      req = Cloudinary::Uploader.upload(params[:file])
      p req
      dam.photo = req["public_id"]
    end # upload check

    dam.update_attributes(dam_params)
    dam.save

DELETE FROM "dams" WHERE "dams"."id" = $1  [["id", 63]]
---
  def destroy
    Dam.destroy params[:id]