app/controllers/pages_controller.rb

    def dashboard
        @bookings = Booking.all
        @users = User.all
        @dams = Dam.all
---
SELECT "bookings".* FROM "bookings"
SELECT "users".* FROM "users"
SELECT "dams".* FROM "dams"