app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "membership", "phone", "car_reg", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    User.create user_params